/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת זכויות החייל";

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "7:00";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = { 
    // שם נושא
    'זכויות חיילי חובה' : {
        "icon":  "../assets/images/opening/comta.svg", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: `עד איזה שעה חייל זכאי הת"ש צריך להגיע לביתו?                 `,
                ans1: "17:30",
                ans2: "8:00",
                ans3: "20:00",
                ans4: "לפי שיקול דעת",
                correctAns: "ans3"
            },
            {
                type: "binary",
                sentence: `חייל זכאי הת"ש אינו יכול לבצע תעסוקה מבצעית                `,
                trueOrFalse: true
            },
            {
                type: "multiple",
                question: `למי נכנס תשלום התשמ"ש?`,
                ans1: "לחשבון החייל",
                ans2: "לחשבון המשפחה/ בת זוג",
                ans3: "לחוגר",
                ans4: "למפקד החייל",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "אחת לכמה זמן מגיע יום סידורים לחייל הבודד?",
                ans1: "כל שבוע",
                ans2: "כל חודש",
                ans3: "כל חצי שנה ",
                ans4: "פעם בחודש בהכשרה ראשונית/ חודשיים בסדיר ",
                correctAns: "ans4"
            },
            {
                type: "binary",
                sentence: "האם חייל בודד זכאי להובלת ציוד אישי?",
                trueOrFalse: true
            },
            {
                type: "binary",
                sentence: "כל חייל שרוצה לעבוד בעת שירותו הצבאי יכול לקבל היתר עבודה? ",
                trueOrFalse: true
            },
            {
                type: "binary",
                sentence: "האם ניתן לקבל סיוע כלכלי ללא אישורים? ",
                trueOrFalse: false
            },
            {
                type: "multiple",
                question: "מי הגורם המאשר חופשה מיוחדת?",
                ans1: `מפקד היחידה`,
                ans2: `מ"פ`,
                ans3: `רס"ן`,
                ans4: `מפקד ישיר `,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "איזה חופשה מיוחדת אינה מטכלית?",
                ans1: `פטירה של קרוב מדרגה ראשונה`,
                ans2: `פטירה של קרוב מדרגה שנייה`,
                ans3: `מיוחדת משפחתית בגין אשפוז`,
                ans4: `אזכרה שנתית של קרוב מדרגה ראשונה`,
                correctAns: "ans3"
            },
        ],
        "amountOfQuestions": 2,
        "learningContent": {
            'הת"ש': {
                'תפקיד משקית הת"ש': [ 
                    {
                        cardType: "picAndText",
                        content: `מענה לצורכי משפחתו של החייל המחייבים את נוכחותו בבית לאור הנסיבות (סוציאליות, רפואיות או אישיות), זאת על מנת שהחייל יוכל לסעוד את בן משפחתו הזקוק לעזרה.                         `,
                        pic: `../assets/images/learning/triangle1.png`,
                    },
                    {
                        cardType: "text",
                        content: `לסגל הת"ש יש את הכלים המקצועיים לעזור לחיילים שלכם!
                        מעורבות המפקדים בטיפול הת"ש ושיתוף פעולה בין הגורמים יגרום לחייל בטחון ובכך יוכל להתפנות לשירותו הצבאי. <br>
                        משרד הת"ש עומד לרשותכם לכל שאלה, בעיה והתייעצות! 
                        `,
                    },
                ],
                'הקלות בתנאי שירות': [ 
                    {
                        cardType: "picAndText",
                        content: `תפקיד משקית הת"ש הינו לסייע למפקד בתחום הטיפול בפרט.
                        לשניהם מטרה משותפת- להעניק לחייל את הטיפול הטוב ביותר
                        `,
                        pic: `../assets/images/learning/triangle2.png`,
                    },
                    {
                        cardType: "listNumbers3",
                        numList : `5`,
                        li1: `המפקד מחוייב לשחרר את חייליו זכאי הת"ש לכל המאוחר עד השעה 17:30 ובאופן שבו יגיעו לביתם עד 20:00`,
                        li2: `תעסוקה מבצעית- חיילים הזכאים להקלות 1, 2, 3, 5 יוכלו לבצע תעסוקה מבצעית עד 14 יום בשנת שירות. חיילים זכאי הת"ש 7 לא יבצעו תעסוקה מבצעית כלל. `,
                        li3: `הגברת כוננות- מפקד בדרגת אל"מ רשאי למנוע מחייל מימוש הקלות להן זכאי במידה וקיימת הגברת כוננות.`,
                        li4: `שישי שבת יימנו כלילה אחד.`,
                        li5: `ניתן לרתק חייל זכאי הת"ש`,
                    },
                ],
            },
            'אוכלוסייה מיוחדת': {
                'חיילים המשתייכים לאוכלוסייה מיוחדת': [ 
                    {
                        cardType: "listNumbers3",
                        numList : `7`,
                        li1: `בודדים`,
                        li2: `תשמ"ש ואחים זכאי תשמ"ש`,
                        li3: `הת"ש`,
                        li4: `חיילים ממשפחות שכולות/ נפגעי פעולות איבה`,
                        li5: `חיילי איתן`,
                        li6: `עולים חדשים`,
                        li7: `חייל נשוי`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `יש לבצע ראיון אוכלוסייה מיוחדת בקליטה ליחידה, באישור זכאות ואחת לחצי שנה, על מנת לזהות מצוקות או בעיות פרט שיכולות להתעורר אצל אוכלוסייה זו. `,
                        text2: `חובת מ.ת"ש לתזכר- חובת המפקד לבצע! `,
                    },
                ],
                'הטבות החייל הנשוי': [ 
                    {
                        cardType: "listDots3",
                        numList : `6`,
                        li1: `חופשת נישואין- 10 ימים ע"ח מיוחדת, אין לקזז ימי חופש. `,
                        li2: `מענק חד פעמי בגובה 810.20 ₪ לרגל הנישואין.`,
                        li3: `חייל בודד הנישא במהלך השירות, יהיה זכאי למענק נוסף ע"ס 270.1 ₪.`,
                        li4: `חייל נשוי השוכר דירה/ משלם משכנתא זכאי להשתתפות בשכ"ד ע"ס 795 ₪ בחודש.`,
                        li5: `חייל נשוי אב לילד ומשרת ברמ"פ א' ומעלה יהיה זכאי תשמ"ש ויקבל 50% מתקרת השכ"ד.`,
                        li6: `חייל נשוי בעל מצוקה כלכלית העומד בקריטריונים יוכל להגיש בקשה לתשמ"ש. `,
                    },
                ],
            },
            "החייל הבודד": {
                'סוגי בודדים': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `בודד מובהק- חייל אשר הוריו שוהים בחו"ל (מגורים, שליחות, ירידה מהארץ)`,
                        li2: `בודד חסר עורף משפחתי- חייל שנמצא בנתק בלתי ניתן לגישור עם הוריו. החייל הורחק מהמסגרת המשפחתית והיא אינה מספקת לו תמיכה. `,
                        li3: `בודד יתום- הוריי החייל נפטרו (שניהם)`,
                    },
                ],
                'ביקורי בית לחייל הבודד': [ 
                    {
                        cardType: "textThreeParagraphs",
                        numList : `3`,
                        text1: `ביקור בית לחייל הבודד יעשה על ידי מפקדו וסגל הת"ש אחת לשנה כדי בלדוק את תנאי הדיור שבו חי החייל.`,
                        text2: `חייל בודד ששינה כתובת במהלך השירות, יבוצע ביקור בית נוסף תוך חודשיים בכתובתו החדשה.`,
                        text3: `יש למלא דו"ח לאחר ביקור הבית. <br><br>ניתן לסייע בהובלת ציוד אישי באישור מפקד היחידה.`,
                    },
                ],
                'הטבות כלכליות הניתנות לחיילים בודדים': [ 
                    {
                        cardType: "listDots3",
                        numList : `6`,
                        li1: `תוספת כספית חודשית לשכר ע"ס 540 ₪ בחודש.`,
                        li2: `שי לחג בראש השנה ופסח ע"ס 500 ₪.`,
                        li3: `יום סידורים פעם בחודש (בהכשרה ראשונית) או חודשיים (בסדיר).`,
                        li4: `תווי קנייה- זכאות חודשית ע"ס 150 ₪ לרכישת מזון.`,
                        li5: `חייל המתגורר בדירת אל"ח יהיה זכאי ל400 ₪ בחודש לרכישת מזון.`,
                        li6: `בודד מובהק- ניתן להגיש מימון כרטיס טיסה מלא לביקור הורים אחת לשירות.`,
                    },
                ],
                'פתרונות דיור לחייל הבודד': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `לינה בבית החייל/ אימוץ בקיבוץ/ דירת אל"ח/ שכר דירה.`,
                        text2: `יש להגיש בקשה מסודרת לפי הקריטריונים הרלוונטיים. `,
                    },
                ],
            },
            "כספים": {
                'סיוע כלכלי': [ 
                    {
                        cardType: "listDots3",
                        numList : `6`,
                        li1: `תווי קנייה- לרכישת מוצרי מזון ברשת שופרסל. `,
                        li2: `מענק- מתן סכום כספי עד 5,000 ₪ בשנה לחייל ברמ"פ א' ומעלה. יתר החיילים יוכלו לקבל מענק מרבי עד 4,000 ₪ בשנה. `,
                        li3: `מענק מתמשך- מענק המתקבל כל חודש.`,
                        li4: `הלוואה- מתן סכום כספי עד 1,200 בשנה. החזר הלוואה יורד ממשכורתו של החייל, 100 ₪ בחודש.`,
                        li5: `קרן הסיוע- קבלת מוצרי חשמל, ריהוט, תווים לביגוד ומזון.`,
                        li6: `מענק בזק- במקרים דחופים, סיוע כלכלי מיידי ללא צורך באישורים. `,
                    },
                ],
                'היתר עבודה פרטי': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `כל חייל שמעוניין לעבוד בעת שירותו הצבאי מחויב בהיתר עבודה פרטי על מנת להיות מבוטח.`,
                        text2: `היתר עבודה פרטי מאושר לחייל המוכיח מצוקה כלכלית או אם החייל ברמ"פ א' ומעלה. `,
                        text3: `חייל אשר עובד ללא אישור עבודה אינו מבוטח. וודאו כי חיילים עובדים עם היתר מוזן ומוכר למשרד הת"ש!<br><br>סמכות אישור- רס"ן ומעלה `,
                    },
                ],
            },
            "מיוחדת": {
                'חופשות מיוחדות': [ 
                    {
                        cardType: "listDots3",
                        numList : `5`,
                        li1: `חופשה מיוחדת כלכלית/ אישית/לימודים- ניתן לאשר לכל חייל עד 45 ימים בשנת שירות. 5 ימים ראשונים ע"ח ימי חופש של החייל. `,
                        li2: `חופשה משפחתית- בגין פציעה/ מחלה/ אשפוז של קרוב מדרגה ראשונה. `,
                        li3: `חופשת אבל קרוב מדרגה ראשונה- מיום הפטירה עד יום הקבורה ו7 ימים נוספים. יש לראיין את החייל עם חזרתו מהמיוחדת. `,
                        li4: `אזכרה שנתית של קרוב מדרגה ראשונה- מיוחדת בת 24 שעות. `,
                        li5: `חופשת אבל של קרוב מדרגה שנייה- חייל זכאי לחופשת אבל בת 3 ימים לפטירת סבים.`,
                    },
                    {
                        cardType: "text",
                        content: `סמכות אישור- רס"ן ומעלה.<br>
                        שום חופשה לא מאושרת באופן אוטומטי- יש לעדכן את סגל הת"ש טרם יציאת החייל לחופשתו. 
                        `,
                    },
                ],
            }
        },
    },
    "זכויות משרתי הקבע": {
        "icon":  "../assets/images/opening/discit.svg",
        // שאלות לנושא הזה
        "questions": [
            // {
            //     type: "multiple",
            //     question: ``,
            //     ans1: ``,
            //     ans2: ``,
            //     ans3: ``,
            //     ans4: ``,
            //     correctAns: "ans3"
            // },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            'כניסה לקבע': {
                'כללי': [ 
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `עם כניסתך לקבע תזומן למרכז הכניסה לקבע, בו תקבל הסברה ומידע אודות "חבר", זכויות פנסיה וביטוחים, הצטרפות לקרן השתלמות, קופת גמל ועוד.`,
                        li2: `מרכז הכניסה לקבע ממוקם בתל השומר, שער צפון, צמוד למתחם השק"ם הגדול.`,
                        li3: `למרכז הכניסה לקבע נדרש להגיע עם תעודת קצין/נגד ותעודת זהות. `,
                        li4: `*קבע (שנת ר')- קבע ראשוני יוגדר עד שנה וחצי בשירות. שירות קבע קצר מכך מחייב את אישור חטיבת הסגל`,
                    },
                ],
                'מענק השחרור': [ 
                    {
                        cardType: "listDots3",
                        numList : `2`,
                        li1: `מענק השחרור לו זכאי כל מסיים שירות חובה יכנס בשכר הקבע הראשון או השני, תלוי במועד הכניסה לקבע ומועד גזירת השכר. `,
                        li2: `דמי המענק והפיקדון נגזרים ממסלול השירות, תנאי השירות והתפקיד אותו ביצעת במסגרת שירות החובה`,
                    },
                ],
                'טיפול ת"ש': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `עם הכניסה לקבע מבוטלות כל זכאויות הת"ש להם זכאים בשירות חובה. במקרים חריגים ניתן לפנות לקצינת הת"ש. `,
                        text2: `חייל בודד הנכנס לקבע- יהיה זכאי להמשך השתתפות בשכ"ד למשך השנתיים הראשונות בקבע, ללא תלות בתנאים נוספים, בתום שנתיים זכאותו תיבחן כיתר משרתי הקבע.`,
                    },
                ],
                'הארכת שירות': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `שלושה חודשים טרם מועד השחרור נדרש משרת הקבע לחתום על הארכת שירות או לחילופין על הצהרת אי נכונות להארכת שירות. `,
                        text2: `תאריך השחרור משפיע על זכאויות שונות בניהן זכאות לנופש, חופשות, נקודות ועוד. `,
                    },
                ],
                'מענק התמדה': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `מענק התמדה יינתן למשרתי קבע בדרגת סרן העומדים באחד מהתנאים הבאים:`,
                        text2: `<ul class="list">
                        <li>הזכאות לתשלום מענק ההתמדה הינה למשך 4 פעימות, כל חצי שנה מיום הזכאות הראשון. </li><li>מענק ההתמדה יהיה בגובה המשכורת של משרת הקבע בגין החודש בו משולם המענק למעט החזרי הוצאות, תשלומים שנתיים, גילום מס וזקיפת הטבה למס. </li><li>בגין מענק התמדה יבוצעו הפרשות וניכויים לפנסיה צוברת, אך אינו נכלל לצורך חישוב פיצויי פיטורין. </li><li>ישנם תנאים לקבלת מענק התמדה עבור קצינים בדרגת סרן אשר היו נגדים בדרגת רס"ל ומעלה והוכשרו לקצונה.</li></ul>`,
                    },
                ],
                'החלפת חוגר': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `בעת עלייה בדרגה נדרש להחליף את החוגר בתא תעודות במקמש"ר, בתנאי והדרגה מוזנת ברשומת. `,
                        text2: `תא תעודות פתוח בימים א'  - ה', בין השעות 08:30 – 17:00. <br>מענה בטלפון: 03-6755935.`,
                    },
                ],
            },
            'כרטיסי חבר': {
                'כרטיס אשראי יהלום': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `כרטיס אשראי חוץ בנקאי המעניק את הטבות "חבר", בניהן פטור מדמי כרטיס, הטבות והנחות במעמד החיוב, מסגרת אשראי רחבה, פטור מעמלות משיכת מזומן ועוד.`,
                        text2: `את הכרטיס ניתן להזמין בטלפון 1-700-50-30-20 לאחר במערכת 'חבר' כמשרתי קבע. קליטה (כחודש מכניסה לקבע). `,
                    },
                ],
                'כרטיס אשראי "חבר של קבע"': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `כרטיס המזכה בהנחה במגוון רחב של בתי עסק מובילים. ניתן לטעון את הכרטיס בעד 2,000 ₪ בחודש וליהנות מ-30% הנחה על טעינת 1,000 השקלים הראשונים ו-25% הנחה על טעינת 1,000 השקלים הנוספים.`,
                        text2: `בראש השנה וחג הפסח יוענק 'שי הרמטכ"ל' ע"ס 500 ₪ שייטענו לכרטיס, בחג החנוכה יוענק שי ע"ס 360 שש"ח למשרתי הקבע הראשוני, יינתן שי ליולדת ע"ס 300 ₪.`,
                    },
                ],
                'כרטיס אשראי "חבר טעמים"': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `הכרטיס המזכה בהנחה במגוון מסעדות, מסעדות שף הזמנת מזון באונליין (לא כולל ארוחות עסקיות).  טעינת הכרטיס זהה לטעינת "חבר של קבע".`,
                        text2: `אתר "חבר" באינטרנט:  www.hvr.co.il  | טלפון: 03-6100100`,
                    },
                    {
                        cardType: "listDots3",
                        numList : `5`,
                        li1: `עבור שני הכרטיסים (חבר של קבע וחבר טעמים)  ניתן לבטל טעינה עד 14 יום.`,
                        li2: `הטעינה מתבצעת דרך אתר "חבר" ובאמצעות כרטיס אשראי "חבר" בלבד. `,
                        li3: `פירוט טעינות ורכישות ניתן לראות באתר "חבר".`,
                        li4: `ניתן לצפות ברשימת בתי העסק המכבדים את הכרטיסים באתר "חבר". `,
                        li5: `במידה ותוקף הכרטיס מסתיים, כרטיס חדש ישלח לכתובת המגורים המעודכנת ברישומי "חבר".  במידה וישנה בעיה יש ליצור קשר עם מוקד "חבר".`,
                    },
                ],
                'כרטיס נקודות': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `כרטיס נקודות (הכרטיס האפור) מזכה את משרת הקבע בנקודות ובהנחה לקניית מדים ומוצרי צריכה בסיסיים לשירות הצבאי.`,
                        text2: `יש להזמין עם הכניסה לקבע דרך מוקד מר"ץ או דרך פתיחת פניה במערכת ה-CRM. `,
                        text3: `הכרטיס יישלח לביתכם עד 21 ימים. הכרטיס מנופק ע"י מרכז ציוד (מר"צ).`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `זכאות לנקודות:`,
                        text2: `<ul class="list"><li>עד שנה בקבע – 275 נקודות מדים + 644 נקודות ספורשיות.</li><li>מעל שנה בקבע – 275 נקודות מדים + 1,909 נקודות ספורשיות.</li></ul>`,
                    },
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `הנקודות הינן עבור שנה קלנדארית ועבור חלקי שנה ניתנות באופן יחסי. `,
                        li2: `הנקודות נצברות משנה לשנה. `,
                        li3: `כספ"ר - הנחה של 25% בחנויות מסוימות בנוסף להנחה הקבועה.`,
                        li4: `ברור יתרת נקודות – באתר 'נקודות' באינטרנט האזרחי/ בקיוסק המידע האישי בצהלנ"ט/ בכל אחת מהחנויות/באתר מולטיפאס. `,
                    },
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `* ניתן לממש את הנקודות עד 30 יום לאחר השחרור משירות קבע. `,
                        li2: `ניתן לקבל מקדמה של נקודות מדים בלבד עבור שנה"ע הבאה ולמול תנאי חתימת קבע (עד 250 נקודות). `,
                        li3: `ניתן לקבל תוספת נקודות מדים תמורת חיוב בשכר ממשכורתם של אנשי קבע – עד 550 נקודות. `,
                        li4: `"מדים עד הבית" – ניתן להזמין מדים עד הבית בעלות משלוח של 28 ₪ דרך האתר madim.atal.idf.il.`,
                    },
                ],
            },
            'ביטוחים': {
                'ביטוח חיים': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `החברה המבטחת את משרתי הקבע ובני/ות זוג/ן – "איילון".`,
                        text2: `עיקרי הפוליסה:<ul class="list">
                        <li>פיצוי כספי חודשי של אובדן כושר עבודה מוחלט.</li><li>פיצוי כספי למבוטח שגילו נמוך מ-65, במקרה של נכות תעסוקתית מוחלטת ותמידית.</li><li>תשלום סכום חד פעמי פטור ממס למוטבים במקרה של פטירת המבוטח. </li></ul>`,
                        text3: `1-700-700-682 שלוחה 6 `,
                    },
                ],
                'ביטוח בריאות': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `החברה המבטחת את משרתי הקבע, בני/ות זוגם/ן וילדיהם עד גיל 25 – הפניקס, מדנס`,
                        text2: `עיקרי הפוליסה:<ul class="list">
                        <li>החזרים בגין רכישת תרופות מחוץ לסל הבריאות.</li><li>השתתפות בהוצאות השתלות איברים בחו"ל.</li><li>השתתפות בהוצאות טיפולים רפואיים פרטיים.</li></ul>`,
                        text3: `*2342 שלוחה 2`,
                    },
                ],
                '"ביטוחבר"': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `מרכז המעניק שירות וסיוע למשרתי הקבע ונועד על מנת לעשות סדר בביטוחים. `,
                        text2: `השירות הינו ללא עלות.`,
                        text3: `03-5304040 | אתר "חבר" – ביטוחים תמונת מצב `,
                    },
                ],
            },
            'גמול השתלמות': {
                'כללי': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `משרת קבע זכאי לתוספת גמול כספי עבור השתלמויות וקורסים אשר ביצע הן במסגרת צבאית והן במסגרת אזרחית (ואושרו ע ע"י וועדת קורסים צה"לית). `,
                        text2: `גמול ההשתלמות יקבע ע"פ עמידה בשעות מזכות (קורסים בעלי זיקה למקצוע הצבאי אשר בוצעו בטווח של 5 שנים) ושעות משלימות.`,
                    },
                ],
                'סוגי גמולי השתלמות': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `גמול השתלמות א'
                        זכאים בעת כניסה לקבע ובתנאי שביצעו קורס קצינים.
                        `,
                        text2: `גמול השתלמות ב' 
                        מזכה לאחר סיום  תואר טכנאי ומעלה + ביצוע 400 שעות.
                        `,
                        text3: `לבירורים נוספים יש לפנות לקצין המשא"ן היחידתי.`,
                    },
                ],
                'דרכי תקשורת גמול השתלמות': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `דוא"ל צבאי: גמול השתלמות/שאלות ובירורים/הגשת טפסים`,
                        text2: `דוא"ל צבאי – השכלה ודירוגים: השכלה ודירוגים/שאלות ובירורים/הגשת טפסים `,
                        text3: `דו"אל אזרחי: Gmush@mail.idf.il`,
                    },
                ],
            },
            'מכון הקבע': {
                'כללי': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `מכון הייעוץ לאיש הקבע ומשפחתו הוקם לשם מתן ייעוץ וטיפול פסיכולוגי לאנשי קבע. (ניתן לפנות לאחר שנת הקבע הראשונה)
                        הטיפול ניתן בהתאם לצורך העולה מאיש הקבע וע"ב התרשמות מקצועי, וכן היקף הטיפול נקבע בהתאמה`,
                        text2: `הטיפול ניתן ע"י צוות המכון וע"י מטפלים אזרחיים בפריסה ארצית.`,
                    },
                    {
                        cardType: "listDots3",
                        numList : `5`,
                        li1: `טיפול במצבי משבר הנובעים מאירועים משונים ונסיבות צבאיות שונות. `,
                        li2: `טיפול בפסיכותרפיה.`,
                        li3: `טיפול פסיכיאטרי תרופתי.`,
                        li4: `טיפול זוגי.`,
                        li5: `ייעוץ בנושאים הקשורים לילד והדרכת הורים.`,
                    },
                    {
                        cardType: "textThreeParagraphs",
                        text1: `איש קבע החש כי הוא זקוק לסיוע מקצועי, מוזמן לפנות למכון הקבע באופן ישיר ודיסקרטי.`,
                        text2: `לאחר פגישת התרשמות והערכה ראשונית יופנה איש הקבע לטיפול בהתאם לתוכנית הטיפול המתאימה לו. `,
                        text3: `הזכאות לטיפול הינה החל מהשנה השנייה בקבע ועד פרישה ואינה בתשלום.`,
                    },
                ],
                'דרכי תקשורת': [ 
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `מכון הקבע יבשה:<br> 0768600010`,
                        li2: `מכון הקבע חיל האוויר:<br> 03-6771217`,
                        li3: `מכון הקבע חיל הים:<br> 04-8693241`,
                        li4: `מכון הקבע חיל המודיעין:<br> 03-5695241`,
                    },
                ],
            },
            'השתתפות בשכר דירה': {
                'שכר דירה': [ 
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `הטבת דיור ניתנת מטעמי כוננות ולא מטעמי פרט, ובתנאי שמשרת הקבע עומד בתנאים הרלוונטיים`,
                        li2: `השתתפות בדיור זוכה למס מופחת.`,
                        li3: `הגשת הבקשה באזור האישי באתר צה"ל`,
                        li4: `משך הזכאות ל-7 שנים במצטבר כמפורט: שנים 1-2 – 100% מהתקרה, שנים 3-4 75% מהתקרה, שנים 5-7 50% מהתקרה.`,
                    },
                ],
                'השתתפות בשכר דירה': [ 
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `הטבת דיור ניתנת מטעמי כוננות ולא מטעמי פרט.`,
                        li2: `השתתפות בדיור זוכה למס מופחת.`,
                        li3: `ההשתתפות היא עד 7 שנים`,
                        li4: `הגשת הבקשה באזור האישי באתר צה"ל בהתאם לעמידה בקריטריונים`,
                    },
                ],
                'הובלת דירה': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `משרת קבע שעובר ממקום מגורים קבוע להטבת דיור ולהפך ולא באותו אזור שרות 60/100 ק"מ.`,
                        text2: `משרת קבע העובר מהטבת דיור לדירה פרטית שרכש.`,
                    },
                ],
            },
            'יישוב מזכה במס': {
                'כללי': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `ישנם יישובים הנמצאים על קו העימות, המזכים את משרתי הקבע המתגוררים בהם בזיכוי על תשלום המס.`,
                        text2: `טבלת היישובים מתעדכנת אחת לשנה באתר משרד הפנים.`,
                    },
                ],
                'קריטריונים לזכאות': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `היישוב משמש כמקום מגורים קבוע.`,
                        li2: `מגורים של 12 חודשים רצופים לפחות ביישוב.`,
                        li3: `דרישה למגורים ביישוב בשנת המס.`,
                    },
                ],
                'זיכוי והגשת בקשה': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `הזיכוי נע בשיעור של 7% - 25% מההכנסה בהתאם ליישוב ולתקרה הרשומה בחוק.`,
                        li2: `בכדי להגיש את הבקשה, יש לקבל אישור תושבות מהיישוב. `,
                        li3: `את הבקשה יש להגיש בכל שנה מחדש דרך האזור האישי באתר צה"ל  ע"מ לקבל את ההטבה.`,
                    },
                ],
                'רשימת היישובים המזוכים במס': [ 
                    {
                        cardType: "text",
                        content: `<a href="https://www.kolzchut.org.il/he/%D7%96%D7%99%D7%9B%D7%95%D7%99_%D7%9E%D7%9E%D7%A1_%D7%94%D7%9B%D7%A0%D7%A1%D7%94_%D7%9C%D7%AA%D7%95%D7%A9%D7%91%D7%99%D7%9D_%D7%91%D7%A4%D7%A8%D7%99%D7%A4%D7%A8%D7%99%D7%94">לרשימת היישובים המזוכים במס</a>`,
                    },
                ],
            },
            'החזר הוצאות  נסיעה ברכב פרטי': {
                'זכאות': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `הזכאות ניתנת למשרתי קבע בשירות, שאינם בעלי רכב צבאי, ונוסעים בפועל ברכבם הפרטי למקום השירות`,
                        text2: `אופן קביעת גובה ההשתתפות הינו בהתאם לפרמטרים שונים (רמת פעילות, מקום מגורים ועוד): <ul class="list">
                        <li>ע"מ להזין החזר זה יש למלא טופס 'החזר הוצאות נסיעה ברכב פרטי', אותו ניתן להוריד מאתר צה"ל, ולצרף לבקשה זו רישיון רכב תקין ובתוקף, ביטוח רכב תקין ובתוקף, רישיון הנהג וצילום חוגר. </li><li>הזכאות להחזר זה מסתיימת אוטומטית ונדרש להאריכה בסיום תוקף רישיון הרכב או הביטוח או לחילופין בסיום החתימה.</li><li>לפרטים נוספים יש לפנות לקצין המשא"ן ביחידה.</li></ul>`,
                    },
                ],
                'החזר הוצאות מעל התקרה': [ 
                    {
                        cardType: "textThreeParagraphs",
                        text1: `משרת קבע יהיה זכאי להחזר הוצאות נסיעה ברכב פרטי מעל התקרה (125%) במידה ועומד באחד משני הקריטריונים הבאים:`,
                        text2: `מרחק של 100 ק"מ מהיחידה או מרחק של 40 ק"מ לפחות מהיחידה ונדרש ב-4 קווי אוטובוס שונים לכל כיוון או המתנה של מעל 45 דק' לאוטובוס. `,
                        text3: `משרת קבע הזכאי להטבת דיור לא יהיה זכאי להחזר הוצאות מעל התקרה.  `,
                    },
                ],
            },
            'נופש': {
                'נופש בזכאות': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `נופש צבא קבע – זכאות לאחר 4 שנות וותק בשירות תקין (חובה+קבע)`,
                        li2: `נופש מבצעי – זכאות לאחר 3.5 שנות וותק בשירות תקין (חובה+קבע)`,
                        li3: `נופש מפקד לוחם- זכאות למפקד לוחם בלבד עפ"י הגדרת מחלקת הסגל`,
                    },
                    {
                        cardType: "textThreeParagraphs",
                        text1: `מחיר ללילה נע בין 200-800 ₪ בהתאם למחזור המבוקש ולסוג הזכאות. `,
                        text2: `הזמנת נופש בזכאות מתבצעת דרך אתר צה"ל ובאמצעות כניסה מהאזור האישי.`,
                        text3: `פתיחת המכירה הינה בפעימות למחזורי נופש מסוימים`,
                    },
                ],
            },
            'חופשות': {
                'חופשה שנתית': [ 
                    {
                        cardType: "listDots3",
                        numList : `4`,
                        li1: `חופשה לבחירת משרת הקבע ו/או במסגרת חופשות מרוכזות נועדו לאפשר פסק זמן משגרת הפעילות, מנוחה וריענון. `,
                        li2: `הזכאות לחופשה נקבעת בתחילת שנה קלנדרית ובהתאם לוותק בשירות ומחושבת באופן יחסי. תקופת הוותק בשירות לא כוללת זמן לימודים מלאים, חופשת פרישה, השהייה, חל"ת או מעצר. `,
                        li3: `ככלל, לא יוכל משרת קבע לצבור ימי חופשה שנתית ועליו לנצלם במהלך שנת הפעילות. עם זאת, רשאי מפקד בדרגת אל"מ ומעלה לאשר צבירת ימי חופשה – כאשר צבירת הימים הינה עד 8 ימים למימוש בפועל בשנתיים העוקבות ו/או עבור מי שברמת פעילות א' ומעלה – פדיון בשנה העוקבת. `,
                        li4: `צבירת הימים תחושב באופן יחסי בהתאם למספר ימי השירות התקין באותה שנת פעילות. `,
                    },
                ],
                'חופשות נוספות': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `חופשה מיוחדת – תינתן למשרת הקבע בנסיבות חריגות אישיות, עד 14 ימים בלבד בתשלום. אישור החופשה הינה בסמכות קצין המשא"ן הפיקודי. תנאי לאישור החופשה המיוחדת הינו ניצול ימי החופשה השנתית של אותה השנה באופן יחסי וניצול ימי החופשה הצבורה.`,
                        li2: `חופשת אבל – זכאי איש קבע לחופשת אבל בתשלום בשל פטירת קרוב מדרגה ראשונה, מיום הפטירה ועד יום הקבורה ועוד שבעה ימי חופשת אבל מיום הקבורה. בנוסף זכאי משרת הקבע לימי חופשה ביום השלושים וביום השנה למותו.`,
                        li3: `חופשה עקב שמחה משפחתית -  משרת הקבע זכאי למימוש ימי החופשה השנתית לאור אירועים משפחתיים בהתאמה: עבור נישואין יכול משרת הקבע לנצל 10 ימים – החל מחודש לפני הנישואין וחודש לאחריו. עבור שמחה משפחתית זכאי משרת הקבע לנצל 24 שעות חופשה. `,
                    },
                ],
                'חופשת מחלה': [ 
                    {
                        cardType: "listDots3",
                        numList : `6`,
                        li1: `חופשת המחלה הינה זכות סוציאלית בסיסית המוענקת למשרתי הקבע.`,
                        li2: `עבור שנה קלנדרית יהיה זכאי משרת הקבע ל- 30 ימי מחלה (באישור רופא בלבד).`,
                        li3: `ימי מחלה שלא ינוצלו בשנת העבודה יצברו באופן אוטומטי לסל ימי מחלה צבורה – עד 90 יום. `,
                        li4: `חופשות מחלה חריגות עבור בני משפחה – ינוצלו לאחר שנוצל חלק יחסי של החופשה השנתית.`,
                        li5: `ישנן חופשות מחלה חריגות עבור משרת קבע שאחד מהוריו בעל מוגבלות או עבור משרת קבע שבן/ת זוגו/ אחר מילדיו חולה במחלה ממארת – לפרטים נוספים יש לפנות למשרד המשא"ן ביחידתך. `,
                        li6: `במידה וניצל משרת קבע את כלל ימי המחלה שברשותו וכלל ימי חופשה השנתית והצבורה שברשותו, ייגבו ימי המחלה הנוספים במידת הצורך בשכרו אל מול החלטת פורום יקרים במחה"ס. `,
                    },
                ],
            },
            'הלוואות': {
                'הלוואות': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `משרת קבע בעל וותק של שנתיים וחודש בשירות הקבע רשאי להגיש בקשה להלוואה דרך מופת.`,
                        text2: `ההחזר הכספי עבור ההלוואה ינוכה מתלוש השכר של משרת הקבע. `,
                        text3: `ישנן סוגים שונים של הלוואות:<ul class="list">
                        <li>הלוואה תקציבית- הלוואה בריבית נמוכה למטרות שונות (דיור, שיפוץ, נישואין וכו').</li><li>הלוואה בנקאית הלוואה בריבית – משתנה בהתאם לבחירת הבנק ובהתאם לתקופת הלוואה.</li><li>הלוואה הדדית- ללא ריבית, עד 10 אש"ח</li></ul>`,
                    },
                ],
            },
            'שימושי בשבילך': {
                'מופ״ת': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `מוקד אחוד: 1111`,
                        li2: `מייל אזרחי: Mofet.keva_gimlaot@digital.idf.il`,
                        li3: `שירות מענה ב-SMS: 052-2199969 - יש לציין שם מלא ומספר אישי בגוף ההודעה.`,
                    },
                ],
                'נופש': [ 
                    {
                        cardType: "listDots3",
                        numList : `2`,
                        li1: `מכירת הנופש – אתר צה"ל, האזור האישי www.idf.il`,
                        li2: `מייל צבאי : נופש  |  מייל אזרחי : nofesh@mail.idf.il `,
                    },
                ],
                'חבר': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `מוקד שירות טלפוני 03-6100100  |  פקס 03-6100102 `,
                        li2: `מייל : psupport@hvr.co.il `,
                        li3: `חידוש כרטיס כחול / צהוב - ישרכארט: 1700503002 שלוחה3  או: 036364636`,
                    },
                ],
                'נקודות': [ 
                    {
                        cardType: "text",
                        content: `מוקד הנקודות – 03-7374800,<br> שלוחה 5`,
                    },
                ],
                'מרכז מידע פיננסי': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `סיוע בסקירת מצבך הפיננסי, כלים ומוצרים שברשותך, קבלת מידע עבור זכויות והטבות.`,
                        li2: `טלפון - 03-9411411   |   וואטסאפ – 054-3528888`,
                        li3: `מייל אזרחי: Finansim@hvr.co.il`,
                    },
                    {
                        cardType: "listDots3",
                        numList : `5`,
                        li1: `"הראל" – מוקד שירות לביטוח שיניים: 1-700-703-072`,
                        li2: `"הראל" – מוקד שירות קרן השלמות וקרן פנסיה - *2735 או *8251`,
                        li3: `"איילון" – מוקד שירות ביטוח חיים וביטוח תאונות אישיות – 1-700-700-682`,
                        li4: `"אור מרה" – מוקד שירות קופת גמל שכיר - *55652`,
                        li5: `ביטוח בריאות ״הפניקס״ (באמצעות ״מדנס״) - *2342`,
                    },
                ],
                'רפואה': [ 
                    {
                        cardType: "listDots3",
                        numList : `6`,
                        li1: `זימון תורים  - מוקד ״מקול הלב״ - *6690 או 03-9489999`,
                        li2: `שירות SMS:   052-9990110`,
                        li3: `פורטל מקול הלב באתר צה״ל (באזור האישי)`,
                        li4: `מייל צבאי - מקול הלב`,
                        li5: `מייל אזרחי- Moked6690@idf.gov.il`,
                        li6: `זימון תורים דיגיטלי באזור האישי באתר צה"ל דרך ה='מדיקליק'`,
                    },
                ],
                'מרפאות שיניים:': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `צריפין:  03-9571477/8`,
                        li2: `קריה: 03-7372781/7`,
                        li3: `תל השומר (מחנה מקרפ״ר ב׳, ליד שער צפון): 03-7379112/4– קיים מענה "עזרה ראשונה" לשירותי רפואת שיניים דחופה 24/7.`,
                    },
                ],
                'שירות רופא עד הבית לכל עמיתי ״חבר״': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `באמצעות פמי פרימיום - 03-5304040 .`,
                        text2: `החזר על תרופות - ניתן לקבל החזר ע"י הגשת הקבלה המקורית, העתק מההמלצה הרפואית על הצורך בתרופה ומכתב אישי למדור תרופות במר"ץ . טלפון לבירורים- 0304-4615.`,
                    },
                ],
                'מידע שימושי': [ 
                    {
                        cardType: "textTwoParagraphs",
                        text1: `בריאות הנפש - מכון הקבע (מיקו"ם) -  03-5258728/9`,
                        text2: `פניות אזרחים - קפ״ץ (קצין פניות הציבור) - טלפון: 1111`,
                    },
                ],
                'טלפון נייד': [ 
                    {
                        cardType: "listDots3",
                        numList : `3`,
                        li1: `מגוון חבילות סלולר במחירים מותאמים למשרתי צה"ל`,
                        li2: `סלקום- מוקד צה"ל 052-9990777`,
                        li3: `פורטל סלקום צה"ל באינטרנט בקישור- http://idf.cellcom.co.il/  `,
                    },
                ],
            },
        },
        "amountOfQuestions": 0
    }
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}
CARD_TYPES.listDots3 = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}
CARD_TYPES.listNumbers3 = {
    init(card, json) {
        // card.querySelector(".sub-title").innerHTML = json.subTitle;
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}